load_testing/results_for_report/key-value/dyn_3_phases_5_peaks_360s_1000keys.txt
wrk -t2 -c200 --timeout 15s --latency -s readLineByLine.lua -d360s -R3500 http://172.31.11.13:3000/
CONNECTED to addr       172.31.11.13:3000
CONNECTED to addr       172.31.10.136:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000/
  2 threads and 200 connections
  Thread calibration: mean lat.: 915.518ms, rate sampling interval: 3522ms
  Thread calibration: mean lat.: 849.055ms, rate sampling interval: 3467ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.36ms   93.55ms   3.30s    97.56%
    Req/Sec     1.75k    37.77     2.02k    95.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.47ms
 75.000%   13.61ms
 90.000%   29.49ms
 99.000%  407.55ms
 99.900%    1.34s 
 99.990%    2.28s 
 99.999%    3.15s 
100.000%    3.30s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.246     0.000000            1         1.00
       2.055     0.100000       122933         1.11
       2.413     0.200000       245407         1.25
       2.797     0.300000       367743         1.43
       3.389     0.400000       490225         1.67
       4.467     0.500000       612578         2.00
       5.263     0.550000       673951         2.22
       6.467     0.600000       735098         2.50
       8.431     0.650000       796496         2.86
      11.263     0.700000       857755         3.33
      13.615     0.750000       918934         4.00
      15.023     0.775000       949663         4.44
      16.655     0.800000       980140         5.00
      18.703     0.825000      1010854         5.71
      21.295     0.850000      1041389         6.67
      24.831     0.875000      1072102         8.00
      26.975     0.887500      1087385         8.89
      29.487     0.900000      1102724        10.00
      32.559     0.912500      1117956        11.43
      36.671     0.925000      1133319        13.33
      42.559     0.937500      1148582        16.00
      46.655     0.943750      1156268        17.78
      51.807     0.950000      1163901        20.00
      58.911     0.956250      1171567        22.86
      68.415     0.962500      1179241        26.67
      82.879     0.968750      1186879        32.00
      93.823     0.971875      1190697        35.56
     110.783     0.975000      1194537        40.00
     138.367     0.978125      1198368        45.71
     179.071     0.981250      1202183        53.33
     238.079     0.984375      1206013        64.00
     275.199     0.985938      1207926        71.11
     320.511     0.987500      1209841        80.00
     372.735     0.989062      1211761        91.43
     432.383     0.990625      1213669       106.67
     504.319     0.992188      1215584       128.00
     546.815     0.992969      1216539       142.22
     591.871     0.993750      1217500       160.00
     644.607     0.994531      1218463       182.86
     705.023     0.995313      1219414       213.33
     777.215     0.996094      1220368       256.00
     818.687     0.996484      1220850       284.44
     867.839     0.996875      1221326       320.00
     921.599     0.997266      1221803       365.71
     982.015     0.997656      1222284       426.67
    1055.743     0.998047      1222767       512.00
    1101.823     0.998242      1223000       568.89
    1150.975     0.998437      1223241       640.00
    1210.367     0.998633      1223479       731.43
    1270.783     0.998828      1223720       853.33
    1344.511     0.999023      1223957      1024.00
    1393.663     0.999121      1224079      1137.78
    1446.911     0.999219      1224196      1280.00
    1504.255     0.999316      1224318      1462.86
    1565.695     0.999414      1224440      1706.67
    1634.303     0.999512      1224555      2048.00
    1665.023     0.999561      1224616      2275.56
    1710.079     0.999609      1224676      2560.00
    1760.255     0.999658      1224736      2925.71
    1808.383     0.999707      1224796      3413.33
    1874.943     0.999756      1224854      4096.00
    1910.783     0.999780      1224884      4551.11
    1950.719     0.999805      1224915      5120.00
    1996.799     0.999829      1224944      5851.43
    2047.999     0.999854      1224974      6826.67
    2146.303     0.999878      1225004      8192.00
    2222.079     0.999890      1225019      9102.22
    2289.663     0.999902      1225034     10240.00
    2371.583     0.999915      1225049     11702.86
    2437.119     0.999927      1225064     13653.33
    2508.799     0.999939      1225079     16384.00
    2545.663     0.999945      1225086     18204.44
    2592.767     0.999951      1225094     20480.00
    2629.631     0.999957      1225102     23405.71
    2664.447     0.999963      1225109     27306.67
    2715.647     0.999969      1225116     32768.00
    2750.463     0.999973      1225120     36408.89
    2789.375     0.999976      1225124     40960.00
    2828.287     0.999979      1225127     46811.43
    2906.111     0.999982      1225131     54613.33
    2967.551     0.999985      1225135     65536.00
    3008.511     0.999986      1225137     72817.78
    3094.527     0.999988      1225139     81920.00
    3125.247     0.999989      1225140     93622.86
    3172.351     0.999991      1225142    109226.67
    3201.023     0.999992      1225144    131072.00
    3205.119     0.999993      1225145    145635.56
    3207.167     0.999994      1225146    163840.00
    3213.311     0.999995      1225147    187245.71
    3231.743     0.999995      1225148    218453.33
    3239.935     0.999996      1225149    262144.00
    3239.935     0.999997      1225149    291271.11
    3248.127     0.999997      1225150    327680.00
    3248.127     0.999997      1225150    374491.43
    3254.271     0.999998      1225151    436906.67
    3254.271     0.999998      1225151    524288.00
    3254.271     0.999998      1225151    582542.22
    3256.319     0.999998      1225152    655360.00
    3256.319     0.999999      1225152    748982.86
    3256.319     0.999999      1225152    873813.33
    3256.319     0.999999      1225152   1048576.00
    3256.319     0.999999      1225152   1165084.44
    3301.375     0.999999      1225153   1310720.00
    3301.375     1.000000      1225153          inf
#[Mean    =       21.365, StdDeviation   =       93.551]
#[Max     =     3299.328, Total count    =      1225153]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1259219 requests in 6.00m, 323.25MB read
  Non-2xx or 3xx responses: 2
Requests/sec:   3497.84
Transfer/sec:      0.90MB
thread 0 made 629615 requests and got 629609 responses
thread 1 made 629615 requests and got 629610 responses
2022-06-05 04:48:47.874 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-06-05 04:48:53.026 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1663479923518165 
2022-06-05 04:48:57.965 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1655694944727364 
2022-06-05 04:49:02.955 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1366332475985512 
2022-06-05 04:49:07.891 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.139833957349829 
2022-06-05 04:49:12.880 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1135107118175536 
2022-06-05 04:49:17.913 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1435132032146957 
2022-06-05 04:49:22.895 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1016978516978517 
2022-06-05 04:49:27.907 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1197146637519415 
2022-06-05 04:49:32.879 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1218007839520405 
2022-06-05 04:49:37.883 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.112839122170382 
2022-06-05 04:49:42.887 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1254944676947773 
2022-06-05 04:49:47.904 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1134853345554536 
2022-06-05 04:49:52.893 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1338364924814195 
2022-06-05 04:49:57.901 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.105245036152875 
2022-06-05 04:50:02.941 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.095221048863433 
2022-06-05 04:50:07.928 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1212104199416124 
2022-06-05 04:50:12.896 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.127444758553049 
2022-06-05 04:50:17.902 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1298611907766434 
2022-06-05 04:50:22.899 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1117363344051447 
2022-06-05 04:50:27.901 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1143397524071528 
2022-06-05 04:50:32.906 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1260104339849797 
2022-06-05 04:50:37.922 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1136220246630342 
2022-06-05 04:50:42.916 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.110148943540007 
2022-06-05 04:50:47.911 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1254089422028353 
2022-06-05 04:50:52.911 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1189272998736648 
2022-06-05 04:50:57.922 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1156797617684113 
2022-06-05 04:51:02.952 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1066337088985974 
2022-06-05 04:51:07.925 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.240786809372288 
2022-06-05 04:51:12.922 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1901068597035505 
2022-06-05 04:51:17.918 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2068134893324156 
2022-06-05 04:51:22.922 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2270462225786127 
2022-06-05 04:51:27.929 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1835366901529472 
2022-06-05 04:51:32.931 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2068827071981645 
2022-06-05 04:51:37.924 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1973812668695802 
2022-06-05 04:51:42.926 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1952601751674394 
2022-06-05 04:51:47.982 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.177568493150685 
2022-06-05 04:51:53.008 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1900769097322617 
2022-06-05 04:51:57.949 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1927458730527785 
2022-06-05 04:52:03.097 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1946328870745033 
2022-06-05 04:52:07.942 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1943626896083315 
2022-06-05 04:52:12.948 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2108402638371092 
2022-06-05 04:52:17.948 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2164345882757435 
2022-06-05 04:52:22.951 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1903425363730096 
2022-06-05 04:52:27.987 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.223672908434977 
2022-06-05 04:52:32.957 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2118952661695856 
2022-06-05 04:52:38.005 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2004806041881222 
2022-06-05 04:52:42.956 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.218863991662324 
2022-06-05 04:52:47.957 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1874104225190623 
2022-06-05 04:52:52.993 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.177510729613734 
2022-06-05 04:52:58.015 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.219257807998156 
2022-06-05 04:53:03.186 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1805555555555556 
2022-06-05 04:53:08.007 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.214663143989432 
2022-06-05 04:53:12.974 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1692797223025744 
2022-06-05 04:53:17.970 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0945992432060543 
2022-06-05 04:53:22.979 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0855749928305132 
2022-06-05 04:53:27.997 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0778700257658174 
2022-06-05 04:53:32.986 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0988151386172784 
2022-06-05 04:53:37.985 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0974055791527955 
2022-06-05 04:53:42.994 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0967520192472933 
2022-06-05 04:53:47.989 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.051084835265756 
2022-06-05 04:53:52.998 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0712074303405572 
2022-06-05 04:53:58.006 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0677878544369188 
2022-06-05 04:54:03.098 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0761171567492473 
2022-06-05 04:54:08.002 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0992259791654542 
2022-06-05 04:54:13.017 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0779474227987602 
2022-06-05 04:54:18.008 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0866766294976435 
2022-06-05 04:54:22.996 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.049638055842813 
2022-06-05 04:54:28.003 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0807965209430077 
2022-06-05 04:54:33.011 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0737348294023357 
2022-06-05 04:54:38.024 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.067377105534548 
2022-06-05 04:54:43.011 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0767548906789415 
2022-06-05 04:54:48.022 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0678577563992442 
2022-06-05 04:54:53.009 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0694915254237287 
2022-06-05 04:54:58.012 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN